Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF6527.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SSP2CON1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SSP2CON1" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xF63">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSPM" edc:desc="" edc:mask="0xf" edc:name="SSPM" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="CKP" edc:desc="" edc:mask="0x1" edc:name="CKP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSPEN" edc:desc="" edc:mask="0x1" edc:name="SSPEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSPOV" edc:desc="" edc:mask="0x1" edc:name="SSPOV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WCOL" edc:desc="" edc:mask="0x1" edc:name="WCOL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SSPM0" edc:desc="" edc:mask="0x1" edc:name="SSPM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSPM1" edc:desc="" edc:mask="0x1" edc:name="SSPM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSPM2" edc:desc="" edc:mask="0x1" edc:name="SSPM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSPM3" edc:desc="" edc:mask="0x1" edc:name="SSPM3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SSPM02" edc:desc="" edc:mask="0x1" edc:name="SSPM02" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPM12" edc:desc="" edc:mask="0x1" edc:name="SSPM12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPM22" edc:desc="" edc:mask="0x1" edc:name="SSPM22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPM32" edc:desc="" edc:mask="0x1" edc:name="SSPM32" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKP2" edc:desc="" edc:mask="0x1" edc:name="CKP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPEN2" edc:desc="" edc:mask="0x1" edc:name="SSPEN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPOV2" edc:desc="" edc:mask="0x1" edc:name="SSPOV2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WCOL2" edc:desc="" edc:mask="0x1" edc:name="WCOL2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SSP2STAT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SSP2STAT" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xF64">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BF" edc:desc="" edc:mask="0x1" edc:name="BF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UA" edc:desc="" edc:mask="0x1" edc:name="UA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="R_nW" edc:desc="" edc:mask="0x1" edc:name="R/nW" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S" edc:desc="" edc:mask="0x1" edc:name="S" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P" edc:desc="" edc:mask="0x1" edc:name="P" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D_nA" edc:desc="" edc:mask="0x1" edc:name="D/nA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKE" edc:desc="" edc:mask="0x1" edc:name="CKE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMP" edc:desc="" edc:mask="0x1" edc:name="SMP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="R_W" edc:desc="" edc:mask="0x1" edc:name="R_W" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="D_A" edc:desc="" edc:mask="0x1" edc:name="D_A" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="I2C_READ" edc:desc="" edc:mask="0x1" edc:name="I2C_READ" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C_START" edc:desc="" edc:mask="0x1" edc:name="I2C_START" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C_STOP" edc:desc="" edc:mask="0x1" edc:name="I2C_STOP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C_DAT" edc:desc="" edc:mask="0x1" edc:name="I2C_DAT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="nW" edc:desc="" edc:mask="0x1" edc:name="nW" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="nA" edc:desc="" edc:mask="0x1" edc:name="nA" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="nWRITE" edc:desc="" edc:mask="0x1" edc:name="nWRITE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="nADDRESS" edc:desc="" edc:mask="0x1" edc:name="nADDRESS" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.4">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="READ_WRITE" edc:desc="" edc:mask="0x1" edc:name="READ_WRITE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="DATA_ADDRESS" edc:desc="" edc:mask="0x1" edc:name="DATA_ADDRESS" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.5">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="D" edc:desc="" edc:mask="0x1" edc:name="D" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.6">
              <edc:SFRFieldDef edc:cname="BF2" edc:desc="" edc:mask="0x1" edc:name="BF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="UA2" edc:desc="" edc:mask="0x1" edc:name="UA2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RW2" edc:desc="" edc:mask="0x1" edc:name="RW2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="START2" edc:desc="" edc:mask="0x1" edc:name="START2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STOP2" edc:desc="" edc:mask="0x1" edc:name="STOP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DA2" edc:desc="" edc:mask="0x1" edc:name="DA2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKE2" edc:desc="" edc:mask="0x1" edc:name="CKE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMP2" edc:desc="" edc:mask="0x1" edc:name="SMP2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="I2C_READ2" edc:desc="" edc:mask="0x1" edc:name="I2C_READ2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="I2C_START2" edc:desc="" edc:mask="0x1" edc:name="I2C_START2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="I2C_STOP2" edc:desc="" edc:mask="0x1" edc:name="I2C_STOP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DATA_ADDRESS2" edc:desc="" edc:mask="0x1" edc:name="DATA_ADDRESS2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.1">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="READ_WRITE2" edc:desc="" edc:mask="0x1" edc:name="READ_WRITE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S2" edc:desc="" edc:mask="0x1" edc:name="S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2" edc:desc="" edc:mask="0x1" edc:name="P2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D_A2" edc:desc="" edc:mask="0x1" edc:name="D_A2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.2">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="R_W2" edc:desc="" edc:mask="0x1" edc:name="R_W2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="D_nA2" edc:desc="" edc:mask="0x1" edc:name="D_nA2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.3">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="R_nW2" edc:desc="" edc:mask="0x1" edc:name="R_nW2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="I2C_DAT2" edc:desc="" edc:mask="0x1" edc:name="I2C_DAT2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.4">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="nW2" edc:desc="" edc:mask="0x1" edc:name="nW2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="nA2" edc:desc="" edc:mask="0x1" edc:name="nA2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.5">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="nWRITE2" edc:desc="" edc:mask="0x1" edc:name="nWRITE2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="nADDRESS2" edc:desc="" edc:mask="0x1" edc:name="nADDRESS2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
